000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователей/ОповещенияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияПользователей</name>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Копия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытаяКопия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.НастройкиБотов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ТипыСобытийОповещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособОповещения</name>
    <type>
      <types>EnumRef.СпособыОповещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СпособыОповещения/СпособыОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОповещения</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>Telegram</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователей/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы  
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерЗаписи = РеквизитФормыВЗначение("Запись");
	
	Копии = МенеджерЗаписи.Копия.Получить();
	
	Если Копии <> Неопределено Тогда
		СписокКопия = Копии;
	КонецЕсли;
	
	СкрытыеКопии = МенеджерЗаписи.СкрытаяКопия.Получить();
	
	Если СкрытыеКопии <> Неопределено Тогда
		СписокСкрытаяКопия = СкрытыеКопии;
	КонецЕсли;
	
	ПараметрыПисьма = "[Номер] [Дата]";
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ЗаполнитьКопии(ТекущийОбъект.Копия, ТекущийОбъект.СкрытаяКопия);	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    УстановитьВидимостьДоступность();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособИнформированияПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура ТестОповещения(Команда)
	ТестированиеОповещения()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ТестированиеОповещения()
	
	ВидКИ = ОповещенияПользователейВызовСервера.ПолучитьВидКонтактнойИнформации(Запись.СпособОповещения);
	
	НастройкиОповещения = ОповещенияПользователейВызовСервера.ПолучитьСтруктуруНастроекОповещения();
	НастройкиОповещения.СпособОповещения	= Запись.СпособОповещения;
	НастройкиОповещения.ТелоСообщения		= Запись.Текст;
	НастройкиОповещения.ЗаголовокСообщения	= Запись.Тема;
	НастройкиОповещения.Бот					= Запись.Бот;
	
	Если Запись.СпособОповещения = ПредопределенноеЗначение("Перечисление.СпособыОповещения.Email") Тогда
		НастройкиОповещения.Копии	     = ПолучитьМассивСтруктурПолучателейЭлектроннойПочты(СписокКопия.ВыгрузитьЗначения(), ВидКИ);
		НастройкиОповещения.СкрытыеКопии = ПолучитьМассивСтруктурПолучателейЭлектроннойПочты(СписокСкрытаяКопия.ВыгрузитьЗначения(), ВидКИ);
	КонецЕсли;	
	
	МассивПользователей = Новый Массив();
	МассивПользователей.Добавить(Запись.Пользователь);
	
	// для мессенджерів немає "копій", сповіщення для кожного користувача відправляємо окремо
	Если Запись.СпособОповещения = ПредопределенноеЗначение("Перечисление.СпособыОповещения.Telegram") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПользователей, СписокКопия.ВыгрузитьЗначения(), Истина);
	КонецЕсли;	
	
	Для Каждого Пользователь Из МассивПользователей Цикл
	
		// сповіщення робимо по конкретним даним цієї настройки
		ОповещенияПользователейВызовСервера.ВыполнитьПроизвольноеОповещениеПользователей(Пользователь, НастройкиОповещения);
		
	КонецЦикла;	
	
	ТекстСообщения = НСтр("ru = 'Оповещения отправлены!'; uk = 'Сповіщення відправлено!'");
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры // ТестированиеОповещения()

&НаСервереБезКонтекста
Функция ПолучитьМассивСтруктурПолучателейЭлектроннойПочты(МассивПользователей, ВидКонтактнойИнформации)
	
	МассивРезультат = Новый Массив();	
	
	Для Каждого Пользователь Из МассивПользователей Цикл
		МассивРезультат.Добавить(ОповещенияПользователей.ПолучитьСтруктуруПолучателяЭлектроннойПочты(Пользователь, ВидКонтактнойИнформации));
	КонецЦикла;	
	
	Возврат МассивРезультат;
	
КонецФункции // ПолучитьМассивСтруктурПолучателейЭлектроннойПочты()	

&НаСервере
Процедура ЗаполнитьКопии(Копия, СкрытаяКопия)
	
	Копия        = Новый ХранилищеЗначения(СписокКопия, Новый СжатиеДанных(9));
	СкрытаяКопия = Новый ХранилищеЗначения(СписокСкрытаяКопия, Новый СжатиеДанных(9));
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	EMail 	 = ( Запись.СпособОповещения = ПредопределенноеЗначение("Перечисление.СпособыОповещения.Email") );
	Telegram = ( Запись.СпособОповещения = ПредопределенноеЗначение("Перечисление.СпособыОповещения.Telegram") );
		
	Элементы.ГруппаEMail.Видимость = EMail;
	Элементы.ГруппаTelegram.Видимость = Telegram;
		
КонецПроцедуры

#КонецОбласти
